zephyrproject-rtos/zephyr/drivers/crypto/crypto_stm32.c
	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_ecb_encrypt_op, pkt->in_buf, pkt->in_len, pkt->out_buf);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = 16;
	}

	return ret;
}

static int crypto_stm32_ecb_decrypt(struct cipher_ctx *ctx,
				    struct cipher_pkt *pkt)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	int ret;

	/* For security reasons, ECB mode should not be used to encrypt
	 * more than one block. Use CBC mode instead.
	 */
	if (pkt->in_len > 16) {
		LOG_ERR("Cannot encrypt more than 1 block");
		return -EINVAL;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_ecb_decrypt_op, pkt->in_buf, pkt->in_len, pkt->out_buf);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = 16;
	}

	return ret;
}

static int crypto_stm32_cbc_encrypt(struct cipher_ctx *ctx,
				    struct cipher_pkt *pkt, uint8_t *iv)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	int ret;
	uint32_t vec[BLOCK_LEN_WORDS];
	int out_offset = 0;

	(void)copy_words_adjust_endianness((uint8_t *)vec, sizeof(vec), iv, BLOCK_LEN_BYTES);

	session->config.pInitVect = CAST_VEC(vec);

	if ((ctx->flags & CAP_NO_IV_PREFIX) == 0U) {
		/* Prefix IV to ciphertext unless CAP_NO_IV_PREFIX is set. */
		memcpy(pkt->out_buf, iv, 16);
		out_offset = 16;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_cbc_encrypt_op, pkt->in_buf, pkt->in_len, pkt->out_buf + out_offset);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = pkt->in_len + out_offset;
	}

	return ret;
}

static int crypto_stm32_cbc_decrypt(struct cipher_ctx *ctx,
				    struct cipher_pkt *pkt, uint8_t *iv)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	int ret;
	uint32_t vec[BLOCK_LEN_WORDS];
	int in_offset = 0;

	(void)copy_words_adjust_endianness((uint8_t *)vec, sizeof(vec), iv, BLOCK_LEN_BYTES);

	session->config.pInitVect = CAST_VEC(vec);

	if ((ctx->flags & CAP_NO_IV_PREFIX) == 0U) {
		in_offset = 16;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_cbc_decrypt_op, pkt->in_buf + in_offset, pkt->in_len, pkt->out_buf);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = pkt->in_len - in_offset;
	}

	return ret;
}

static int crypto_stm32_ctr_encrypt(struct cipher_ctx *ctx,
				    struct cipher_pkt *pkt, uint8_t *iv)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	int ret;
	uint32_t ctr[BLOCK_LEN_WORDS] = {0};
	int ivlen = BLOCK_LEN_BYTES - (ctx->mode_params.ctr_info.ctr_len >> 3);

	if (copy_words_adjust_endianness((uint8_t *)ctr, sizeof(ctr), iv, ivlen) != 0) {
		return -EIO;
	}

	session->config.pInitVect = CAST_VEC(ctr);

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_ctr_encrypt_op, pkt->in_buf, pkt->in_len, pkt->out_buf);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = pkt->in_len;
	}

	return ret;
}

static int crypto_stm32_ctr_decrypt(struct cipher_ctx *ctx,
				    struct cipher_pkt *pkt, uint8_t *iv)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	int ret;
	uint32_t ctr[BLOCK_LEN_WORDS] = {0};
	int ivlen = BLOCK_LEN_BYTES - (ctx->mode_params.ctr_info.ctr_len >> 3);

	if (copy_words_adjust_endianness((uint8_t *)ctr, sizeof(ctr), iv, ivlen) != 0) {
		return -EIO;
	}

	session->config.pInitVect = CAST_VEC(ctr);

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = do_aes(ctx, hal_ctr_decrypt_op, pkt->in_buf, pkt->in_len, pkt->out_buf);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		pkt->out_len = pkt->in_len;
	}

	return ret;
}

#if IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT)
static int do_aes_staged(struct cipher_ctx *ctx, hal_cryp_aes_op_func_t fn, uint8_t *in_buf,
			 size_t in_len, uint8_t *out_buf)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	uint8_t staging_in[BLOCK_LEN_BYTES] __aligned(4) = {0};
	uint8_t staging_out[BLOCK_LEN_BYTES] __aligned(4);
	int ret;

	/* Zero payload is allowed.
	 * Have to configure and execute the operation
	 * to let the HAL go through required phases.
	 */
	if (in_len == 0) {
		return do_aes(ctx, fn, staging_in, 0, staging_out);
	}

	/* must be valid */
	if (in_buf == NULL) {
		return -EINVAL;
	}

	/* Process complete 16-byte blocks first to avoid zero-padding in
	 * the intermediate data within HAL.
	 * Any trailing partial block is copied into a 4-byte aligned
	 * stage buffer to avoid data corruption.
	 * Trailing block shall be processed without key and nonce reloading
	 * to preserve CRYP state.
	 */
	const size_t rem_len = in_len % BLOCK_LEN_BYTES;
	const size_t aligned_len = in_len - rem_len;

	if (aligned_len != 0) {
		ret = do_aes(ctx, fn, in_buf, aligned_len, out_buf);
		if (ret < 0) {
			return ret;
		}
	}

	if (rem_len == 0) {
		return 0;
	}

	memcpy(staging_in, in_buf + aligned_len, rem_len);

	if (aligned_len == 0) {
		/* have to config, then execute the operation */
		ret = do_aes(ctx, fn, staging_in, rem_len, staging_out);
		if (ret < 0) {
			return ret;
		}
	} else {
		/* skip key and iv init
		 * set to always by default in session setup
		 */
		data->hcryp.Init.KeyIVConfigSkip = CRYP_KEYIVCONFIG_ONCE;
		data->hcryp.KeyIVConfig = 1;

		const status_t fn_rc =
			fn(&data->hcryp, staging_in, rem_len, staging_out, HAL_MAX_DELAY);

		/* restore key and iv init */
		data->hcryp.Init.KeyIVConfigSkip = CRYP_KEYIVCONFIG_ALWAYS;
		data->hcryp.KeyIVConfig = 0;

		if (fn_rc != HAL_OK) {
			LOG_ERR("Encryption/decryption error");
			return -EIO;
		}
	}

	memcpy(out_buf + aligned_len, staging_out, rem_len);

	return 0;
}

static int crypto_stm32_gcm(struct cipher_ctx *ctx, hal_cryp_aes_op_func_t fn,
			    struct cipher_aead_pkt *apkt, uint8_t *nonce)
{
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	uint8_t *dst;
	uint32_t iv[BLOCK_LEN_WORDS] = {0};
	/*
	 * The legacy CRYP header phase always reads HeaderSize as a word count
	 * regardless of HeaderWidthUnit; pad ad into a word-sized scratch buffer so
	 * a non-word-multiple ad_len isn't read as a word count of bytes
	 * (over-reading past the caller's buffer). Typical GCM AAD (protocol
	 * headers/counters) fits the stack buffer with no heap dependency; larger
	 * AAD falls back to a heap allocation sized exactly to what's needed.
	 */
	uint8_t stack_hdr_buf[64] __aligned(4);
	uint8_t *hdr_buf = NULL;
	int ret;

	if (!IN_RANGE(apkt->pkt->in_len, 0, apkt->pkt->out_buf_max)) {
		return -EINVAL;
	}

