zephyrproject-rtos/zephyr/drivers/crypto/crypto_stm32.c
	if ((nonce == NULL) || (ctx->mode_params.gcm_info.nonce_len != 12U)) {
		return -EINVAL;
	}

	if (ctx->mode_params.gcm_info.tag_len != BLOCK_LEN_BYTES) {
		return -EINVAL;
	}

	/* in-place operation can have out_buf set to NULL */
	dst = apkt->pkt->out_buf ? apkt->pkt->out_buf : apkt->pkt->in_buf;

	if (copy_words_adjust_endianness((uint8_t *)iv, sizeof(iv), nonce,
					 ctx->mode_params.gcm_info.nonce_len) != 0) {
		return -EIO;
	}

	iv[3] = 2U;

	session->config.pInitVect = CAST_VEC(iv);

	if ((apkt->ad == NULL) || (apkt->ad_len == 0U)) {
		session->config.Header = NULL;
		session->config.HeaderSize = 0U;
	} else {
		size_t hdr_padded_len;
		uint8_t *hdr_dst;

		if (apkt->ad_len > (UINT32_MAX - (sizeof(uint32_t) - 1U))) {
			/* overflow */
			return -EINVAL;
		}

		hdr_padded_len = ROUND_UP(apkt->ad_len, sizeof(uint32_t));

		if (hdr_padded_len <= sizeof(stack_hdr_buf)) {
			hdr_dst = stack_hdr_buf;
		} else {
#if IS_ENABLED(STM32_CRYPTO_HEAP)
			hdr_buf = k_calloc(1, hdr_padded_len);
			if (hdr_buf == NULL) {
				return -ENOMEM;
			}
			hdr_dst = hdr_buf;
#else
			return -EINVAL;
#endif /* IS_ENABLED(STM32_CRYPTO_HEAP) */
		}

		memset(hdr_dst, 0, hdr_padded_len);
		memcpy(hdr_dst, apkt->ad, apkt->ad_len);

		session->config.Header = CAST_VEC(hdr_dst);
		session->config.HeaderSize = hdr_padded_len / sizeof(uint32_t);
		/*
		 * WORD, not BYTE: HAL_CRYPEx_AESGCM_GenerateAuthTAG() derives the
		 * AAD bit-length fed into the GCM length block from HeaderSize
		 * using HeaderWidthUnit (HeaderSize * 32 for WORD, * 8 for BYTE),
		 * while the header phase itself always consumes HeaderSize as a
		 * word count regardless of HeaderWidthUnit. Both must agree with
		 * the word count actually fed above.
		 */
		session->config.HeaderWidthUnit = CRYP_HEADERWIDTHUNIT_WORD;
	}

	ret = do_aes_staged(ctx, fn, apkt->pkt->in_buf, apkt->pkt->in_len, dst);

	k_free(hdr_buf);

	return ret;
}

static int crypto_stm32_gcm_encrypt(struct cipher_ctx *ctx, struct cipher_aead_pkt *apkt,
				    uint8_t *nonce)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	uint8_t tag[BLOCK_LEN_BYTES] = {0};
	int ret;

	if (apkt->tag == NULL) {
		return -EINVAL;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = crypto_stm32_gcm(ctx, hal_encrypt, apkt, nonce);
	if (ret < 0) {
		goto out;
	}

	if (HAL_CRYPEx_AESGCM_GenerateAuthTAG(&data->hcryp, CAST_VEC(tag),
					      HAL_MAX_DELAY) != HAL_OK) {
		ret = -EIO;
	}

out:
	k_sem_give(&data->device_sem);

	if (ret == 0) {
		memcpy(apkt->tag, tag, ctx->mode_params.gcm_info.tag_len);
		apkt->pkt->out_len = apkt->pkt->in_len;
	}

	return ret;
}

static int crypto_stm32_gcm_decrypt(struct cipher_ctx *ctx, struct cipher_aead_pkt *apkt,
				    uint8_t *nonce)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	uint8_t tag[BLOCK_LEN_BYTES] = {0};
	int ret;

	if (apkt->tag == NULL) {
		return -EINVAL;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = crypto_stm32_gcm(ctx, hal_decrypt, apkt, nonce);
	if (ret < 0) {
		goto out;
	}

	if (HAL_CRYPEx_AESGCM_GenerateAuthTAG(&data->hcryp, CAST_VEC(tag),
					      HAL_MAX_DELAY) != HAL_OK) {
		ret = -EIO;
	}

out:
	k_sem_give(&data->device_sem);

	if (ret < 0) {
		return ret;
	}

	if (STM32_CRYPTO_MEMCMP(tag, apkt->tag, ctx->mode_params.gcm_info.tag_len) != 0) {
		/* auth/tag verification fails */
		return -EFAULT;
	}

	apkt->pkt->out_len = apkt->pkt->in_len;
	return ret;
}

static int crypto_stm32_ccm(struct cipher_ctx *ctx, hal_cryp_aes_op_func_t fn,
			    struct cipher_aead_pkt *apkt, uint8_t *nonce, uint8_t *tag)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	struct crypto_stm32_session *const session = CRYPTO_STM32_SESSN(ctx);
	/* B1 - Associated Data (AD) */
	uint8_t *b1 = NULL;
	uint8_t *dst;
	/* B0 - Authentication block */
	uint8_t b0[BLOCK_LEN_BYTES] __aligned(4) = {0};
	unsigned int idx;
	int ret;
	uint8_t q;

	if (!IN_RANGE(apkt->pkt->in_len, 0, apkt->pkt->out_buf_max)) {
		return -EINVAL;
	}

	/* in-place operation can have out_buf set to NULL */
	dst = apkt->pkt->out_buf ? apkt->pkt->out_buf : apkt->pkt->in_buf;

	/* tag length: 4, 6, 8, 10, 12, 14, 16 */
	if ((ctx->mode_params.ccm_info.tag_len < 4U) ||
	    (ctx->mode_params.ccm_info.tag_len > 16U) ||
	    (ctx->mode_params.ccm_info.tag_len % 2U) != 0U) {
		return -EINVAL;
	}

	/* nonce length [7, 13] */
	if ((nonce == NULL) || (ctx->mode_params.ccm_info.nonce_len < 7U) ||
	    (ctx->mode_params.ccm_info.nonce_len > 13U)) {
		return -EINVAL;
	}

	/* bytes left for payload length */
	q = 15U - ctx->mode_params.ccm_info.nonce_len;

	/* check if payload length fits into q bytes */
	if (apkt->pkt->in_len > BIT_MASK(8U * q)) {
		return -EINVAL;
	}

	if ((apkt->ad == NULL) || (apkt->ad_len == 0U)) {
		session->config.Header = NULL;
		session->config.HeaderSize = 0U;
	} else {
#if IS_ENABLED(STM32_CRYPTO_HEAP)
		size_t b1_padded_len;
		uint8_t header_len;

		if (apkt->ad_len < 0xFF00U) {
			header_len = 2U;
		} else {
			/* ad_len is uint32_t (support len < 0xFFFFFFFFU) */
			header_len = 6U;
		}

		if (apkt->ad_len > (UINT32_MAX - header_len - BLOCK_LEN_BYTES)) {
			/* overflow */
			return -EINVAL;
		}

		b1_padded_len = ROUND_UP(apkt->ad_len + header_len, BLOCK_LEN_BYTES);
		if (b1_padded_len > UINT32_MAX) {
			/* HeaderSize is uint32_t */
			return -EINVAL;
		}

		b1 = k_calloc(1, b1_padded_len);
		if (b1 == NULL) {
			return -ENOMEM;
		}

		if (header_len == 2U) {
			sys_put_be16(apkt->ad_len, b1);
		} else {
			b1[0] = 0xFFU;
			b1[1] = 0xFEU;
			sys_put_be32(apkt->ad_len, b1 + 2U);
		}

		memcpy(b1 + header_len, apkt->ad, apkt->ad_len);

		session->config.Header = CAST_VEC(b1);
		session->config.HeaderSize = b1_padded_len / sizeof(uint32_t);
		session->config.HeaderWidthUnit = CRYP_HEADERWIDTHUNIT_WORD;

		/* set AD presence flag */
		b0[0] = BIT(6);
#else
		return -ENOMEM;
#endif /* IS_ENABLED(STM32_CRYPTO_HEAP) */
	}

	/* encode leftover flags */
	b0[0] |= ((ctx->mode_params.ccm_info.tag_len - 2U) / 2U) << 3U;
	b0[0] |= q - 1U;

