zephyrproject-rtos/zephyr/drivers/crypto/crypto_stm32.c
	/* encode nonce */
	memcpy(&b0[1], nonce, ctx->mode_params.ccm_info.nonce_len);

	/* encode payload length */
	for (idx = 0U; idx < q; idx++) {
		b0[15U - idx] = (uint8_t)((apkt->pkt->in_len >> (8U * idx)) & 0xFFU);
	}

	/* set B0 */
	for (idx = 0U; idx < sizeof(b0); idx += sizeof(uint32_t)) {
		sys_cpu_to_be(&b0[idx], sizeof(uint32_t));
	}

	session->config.B0 = CAST_VEC(b0);

	ret = do_aes_staged(ctx, fn, apkt->pkt->in_buf, apkt->pkt->in_len, dst);

	k_free(b1);

	if (ret < 0) {
		return ret;
	}

	/* compute auth tag, b0 shall be valid; hcryp holds a pointer to it */
	if (HAL_CRYPEx_AESCCM_GenerateAuthTAG(&data->hcryp, CAST_VEC(tag),
					      HAL_MAX_DELAY) != HAL_OK) {
		ret = -EIO;
	}

	return ret;
}

static int crypto_stm32_ccm_encrypt(struct cipher_ctx *ctx, struct cipher_aead_pkt *apkt,
				    uint8_t *nonce)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	uint8_t tag[BLOCK_LEN_BYTES] = {0};
	int ret;

	if (apkt->tag == NULL) {
		return -EINVAL;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = crypto_stm32_ccm(ctx, hal_encrypt, apkt, nonce, &tag[0]);

	k_sem_give(&data->device_sem);

	if (ret == 0) {
		memcpy(apkt->tag, tag, ctx->mode_params.ccm_info.tag_len);
		apkt->pkt->out_len = apkt->pkt->in_len;
	}

	return ret;
}

static int crypto_stm32_ccm_decrypt(struct cipher_ctx *ctx, struct cipher_aead_pkt *apkt,
				    uint8_t *nonce)
{
	struct crypto_stm32_data *const data = CRYPTO_STM32_DATA(ctx->device);
	uint8_t tag[BLOCK_LEN_BYTES] = {0};
	int ret;

	if (apkt->tag == NULL) {
		return -EINVAL;
	}

	k_sem_take(&data->device_sem, K_FOREVER);

	ret = crypto_stm32_ccm(ctx, hal_decrypt, apkt, nonce, &tag[0]);

	k_sem_give(&data->device_sem);

	if (ret < 0) {
		return ret;
	}

	if (STM32_CRYPTO_MEMCMP(tag, apkt->tag, ctx->mode_params.ccm_info.tag_len) != 0) {
		/* auth/tag verification fails */
		return -EFAULT;
	}

	apkt->pkt->out_len = apkt->pkt->in_len;
	return ret;
}
#endif /* IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT) */

static int crypto_stm32_get_unused_session_index(const struct device *dev)
{
	int i;

	struct crypto_stm32_data *data = CRYPTO_STM32_DATA(dev);

	k_sem_take(&data->session_sem, K_FOREVER);

	for (i = 0; i < CRYPTO_MAX_SESSION; i++) {
		if (!crypto_stm32_sessions[i].in_use) {
			crypto_stm32_sessions[i].in_use = true;
			k_sem_give(&data->session_sem);
			return i;
		}
	}

	k_sem_give(&data->session_sem);

	return -1;
}

static int crypto_stm32_session_setup(const struct device *dev,
				      struct cipher_ctx *ctx,
				      enum cipher_algo algo,
				      enum cipher_mode mode,
				      enum cipher_op op_type)
{
	int ctx_idx, ret;
	struct crypto_stm32_session *session;

	if (ctx->flags & ~(CRYP_SUPPORT)) {
		LOG_ERR("Unsupported flag");
		return -ENOTSUP;
	}

	if (algo != CRYPTO_CIPHER_ALGO_AES) {
		LOG_ERR("Unsupported algo");
		return -ENOTSUP;
	}

	if ((mode != CRYPTO_CIPHER_MODE_ECB) &&
	    (mode != CRYPTO_CIPHER_MODE_CBC) &&
	    (mode != CRYPTO_CIPHER_MODE_CTR) &&
	    (!IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT) ||
		((mode != CRYPTO_CIPHER_MODE_CCM) &&
		 (mode != CRYPTO_CIPHER_MODE_GCM)))) {
		LOG_ERR("Unsupported mode");
		return -ENOTSUP;
	}

	/* The STM32F4 CRYP peripheral supports key sizes of 128, 192 and 256
	 * bits.
	 */
	if ((ctx->keylen != 16U) &&
#if defined(STM32_CRYPTO_KEYSIZE_192B_SUPPORT)
	    (ctx->keylen != 24U) &&
#endif
	    (ctx->keylen != 32U)) {
		LOG_ERR("%u key size is not supported", ctx->keylen);
		return -ENOTSUP;
	}

	ctx_idx = crypto_stm32_get_unused_session_index(dev);
	if (ctx_idx < 0) {
		LOG_ERR("No free session for now");
		return -ENOSPC;
	}
	session = &crypto_stm32_sessions[ctx_idx];
	memset(&session->config, 0, sizeof(session->config));

#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
	struct crypto_stm32_data *data = CRYPTO_STM32_DATA(dev);

	if (data->hcryp.State == HAL_CRYP_STATE_RESET) {
		if (HAL_CRYP_Init(&data->hcryp) != HAL_OK) {
			LOG_ERR("Initialization error");
			session->in_use = false;
			return -EIO;
		}
	}
#endif

	switch (ctx->keylen) {
	case 16U:
		session->config.KeySize = CRYP_KEYSIZE_128B;
		break;
#if defined(STM32_CRYPTO_KEYSIZE_192B_SUPPORT)
	case 24U:
		session->config.KeySize = CRYP_KEYSIZE_192B;
		break;
#endif
	case 32U:
		session->config.KeySize = CRYP_KEYSIZE_256B;
		break;
	}

	if (op_type == CRYPTO_CIPHER_OP_ENCRYPT) {
		switch (mode) {
		case CRYPTO_CIPHER_MODE_ECB:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_ECB;
#endif
			ctx->ops.block_crypt_hndlr = crypto_stm32_ecb_encrypt;
			break;
		case CRYPTO_CIPHER_MODE_CBC:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_CBC;
#endif
			ctx->ops.cbc_crypt_hndlr = crypto_stm32_cbc_encrypt;
			break;
		case CRYPTO_CIPHER_MODE_CTR:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_CTR;
#endif
			ctx->ops.ctr_crypt_hndlr = crypto_stm32_ctr_encrypt;
			break;
#if IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT)
		case CRYPTO_CIPHER_MODE_GCM:
			session->config.Algorithm = CRYP_AES_GCM;
			ctx->ops.gcm_crypt_hndlr = crypto_stm32_gcm_encrypt;
			break;
		case CRYPTO_CIPHER_MODE_CCM:
			session->config.Algorithm = CRYP_AES_CCM;
			ctx->ops.ccm_crypt_hndlr = crypto_stm32_ccm_encrypt;
			break;
#endif /* IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT) */
		default:
			CODE_UNREACHABLE;
		}
	} else {
		switch (mode) {
		case CRYPTO_CIPHER_MODE_ECB:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_ECB;
#endif
			ctx->ops.block_crypt_hndlr = crypto_stm32_ecb_decrypt;
			break;
		case CRYPTO_CIPHER_MODE_CBC:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_CBC;
#endif
			ctx->ops.cbc_crypt_hndlr = crypto_stm32_cbc_decrypt;
			break;
		case CRYPTO_CIPHER_MODE_CTR:
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32l4_aes)
			session->config.Algorithm = CRYP_AES_CTR;
#endif
			ctx->ops.ctr_crypt_hndlr = crypto_stm32_ctr_decrypt;
			break;
#if IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT)
		case CRYPTO_CIPHER_MODE_GCM:
			session->config.Algorithm = CRYP_AES_GCM;
			ctx->ops.gcm_crypt_hndlr = crypto_stm32_gcm_decrypt;
			break;
		case CRYPTO_CIPHER_MODE_CCM:
			session->config.Algorithm = CRYP_AES_CCM;
			ctx->ops.ccm_crypt_hndlr = crypto_stm32_ccm_decrypt;
			break;
#endif /* IS_ENABLED(STM32_CRYPTO_GCM_CCM_SUPPORT) */
		default:
			CODE_UNREACHABLE;
		}
	}

